solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_mmu.c
/*
 * Copyright 2023-2024 NXP
 *
 * All rights reserved.
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_mmu.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.mmu"
#endif

#define MMU_UNIT_BYTE_SIZE       (0x1000UL << (uint32_t)(g_selectedUnitSize))

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*!
 * brief Get the MMU instance from the peripheral base address.
 *
 * param base MMU peripheral base address.
 * return MMU instance.
 */
static uint32_t MMU_GetInstance(MMU_Type *base);
#endif

static mmu_lut_word_t MMU_TransferAddrToLUTWord(uint32_t addr);
static uint16_t MMU_TransferAddrToLUTIndex(uint32_t addr);
/*******************************************************************************
 * Variables
 ******************************************************************************/
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
static MMU_Type *const s_mmuBases[] = MMU_BASE_PTRS;

static const clock_ip_name_t s_mmuClock[] = MMU_CLOCKS;
#endif

mmu_unit_size_t g_selectedUnitSize = kMMU_UnitSize4KB;
mmu_page_option_t g_selectedPageOpt = kMMU_PageOpt_1Page;
/*******************************************************************************
 * Code
 ******************************************************************************/

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*!
 * brief Get the MMU instance from the peripheral base address.
 *
 * param base MMU peripheral base address.
 * return MMU instance.
 */
static uint32_t MMU_GetInstance(MMU_Type *base)
{
    uint32_t instance = 0UL;

    for (instance = 0UL; instance < ARRAY_SIZE(s_mmuBases); instance++)
    {
        if (MSDK_REG_SECURE_ADDR(s_mmuBases[instance]) == MSDK_REG_SECURE_ADDR(base))
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_mmuBases));

    return instance;
}
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

static mmu_lut_word_t MMU_TransferAddrToLUTWord(uint32_t addr)
{
    uint32_t maskPerUnitSize[MMU_NUM_OF_UNIT_SIZE] = 
    {
        0x7FFF000UL,    /* Mask for 4KB unit size. */
        0xFFFE000UL,    /* Mask for 8KB unit size. */
        0xFFFC000UL,    /* Mask for 16KB unit size. */
        0xFFF8000UL,    /* Mask for 32KB unit size. */
        0xFFF0000UL,    /* Mask for 64KB unit size. */
    };

    uint32_t shiftPerUnitSize[MMU_NUM_OF_UNIT_SIZE] = 
    {
        12UL,       /* Shift for 4KB unit size. */
        13UL,       /* Shift for 8KB unit size. */
        14UL,       /* Shift for 16KB unit size. */
        15UL,       /* Shift for 32KB unit size. */
        16UL,       /* Shift for 64KB unit size. */
    };
    mmu_lut_word_t lutWord;
    uint8_t unitSizeIndex = (uint8_t)g_selectedUnitSize;

    lutWord.mappedValue = (uint16_t)((addr & maskPerUnitSize[unitSizeIndex]) >> shiftPerUnitSize[unitSizeIndex]);
    lutWord.valid = 1U;

    return lutWord;
}

static uint16_t MMU_TransferAddrToLUTIndex(uint32_t addr)
{
    uint32_t maskPerUnitSize[2U][MMU_NUM_OF_UNIT_SIZE] =
    {
        {
            0x1FFFFFFUL,        /* Mask for 4KB unit size, in 1 page mode  */
            0x3FFFFFFUL,        /* Mask for 8KB unit size, in 1 page mode */
            0x7FFFFFFUL,        /* Mask for 16KB unit size, in 1 page mode */
            0xFFFFFFFUL,        /* Mask for 32KB unit size, in 1 page mode */
            0x1FFFFFFFUL,       /* Mask for 64KB unit size, in 1 page mode */
        },
        {
            0x7FFFFFUL,         /* Mask for 4KB unit size, in 4 page mode. */
            0xFFFFFFUL,         /* Mask for 8KB unit size, in 4 page mode. */
            0x1FFFFFFUL,        /* Mask for 16KB unit size, in 4 page mode. */
            0x3FFFFFFUL,        /* Mask for 32KB unit size, in 4 page mode. */
            0x7FFFFFFUL,        /* Mask for 64KB unit size, in 4 page mode. */
        },
    };

    uint32_t factorPerUnitSize[MMU_NUM_OF_UNIT_SIZE] = 
    {
        0x1000UL,            /* Factor for 4KB unit size.  */
        0x2000UL,            /* Factor for 8KB unit size.  */
        0x4000UL,            /* Factor for 16KB unit size.  */
        0x8000UL,            /* Factor for 32KB unit size.  */
        0x10000UL,           /* Factor for 64KB unit size.  */
    };

    uint8_t unitSizeIndex = (uint8_t)g_selectedUnitSize;
    uint16_t lutPointer = 0U;
    uint8_t pageMode = (g_selectedPageOpt == kMMU_PageOpt_1Page) ? 0U : 1U;


    lutPointer = (addr & maskPerUnitSize[pageMode][unitSizeIndex]) / factorPerUnitSize[unitSizeIndex];
    if (pageMode != 0U)
    {
        uint8_t pageSelect = ((uint8_t)g_selectedPageOpt) & 0x6U >> 1U;
        lutPointer |= pageSelect << 11U;
    }

    return lutPointer;
}

/*!
 * brief Initialize MMU:
 *          1. Enable MMU clock;
 *          2. Define the basic unit that is used in the memory map;
 *          3. Configure valid address range;
 *          4. Fill LUT SRAM;
 *          5. Enable MMU remap function.
 *
 * param base MMU peripheral base address.
 * param config Pointer to the user defined variable in type of mmu_config_t.
 */
void MMU_Init(MMU_Type *base, const mmu_config_t *config)
{
    assert(config);

    /* 1. Enable MMU clock */
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    CLOCK_EnableClock(s_mmuClock[MMU_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    MMU_DoSoftwareReset(base);
    base->CTRL &= ~MMU_CTRL_CLK_DIS_MASK;

    /* 2. Configure unit size to define the basic unit that is used in the memory map. */
    MMU_UpdateUnitSize(base, config->unitSize);
    MMU_ChangePageOption(base, config->pageOpt);

