solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_mmu.c
    /* 3. Configure valid address range. */
    MMU_UpdateValidAddressRange(base, config->baseAddr, config->maxAddr);

    /* 4. Fill LUT SRAM. */
    if ((config->ptrPhyAddrArray != NULL) && (config->ptrVirtualAddrArray != NULL))
    {
        MMU_SetupArrayMap(base, config->ptrVirtualAddrArray, config->ptrPhyAddrArray, config->countOfAddr);
    }

    /* 5. Enable MMU remap function. */
    MMU_EnableMemoryMap(base, config->enableMMP);
}

/*!
 * brief De-initialize MMU:
 *          1. Disable MMU remap function;
 *          2. Reset MMU logic;
 *          3. Disable MMU clock.
 * param base
 */
void MMU_Deinit(MMU_Type *base)
{
    /* 1. Disable MMU remap function. */
    MMU_EnableMemoryMap(base, false);

    /* 2. Reset MMU logic. */
    MMU_DoSoftwareReset(base);

    /* 3. Disable MMU clock. */
    base->CTRL |= MMU_CTRL_CLK_DIS_MASK;
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    CLOCK_DisableClock(s_mmuClock[MMU_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Get default configurations of MMU module.
 *
 * code
 *    config->unitSize        = kMMU_UnitSize4KB;
 *    config->pageOpt        = kMMU_PageOpt_1Page;
 *    config->invalidAddrMode = kMMU_InvalidAddrRespondError;
 *    config->baseAddr = 0x0UL;
 *    config->maxAddr  = 0x0UL;
 *    config->ptrPhyAddrArray = NULL;
 *    config->ptrVirtualAddrArray = NULL;
 *    config->countOfPhyAddr = 0U;
 *    config->enableMMP = false;
 * endcode
 *
 * param config Pointer to the user defined variable in type of mmu_config_t.
 */
void MMU_GetDefaultConfig(mmu_config_t *config)
{
    assert(config);

    config->unitSize        = kMMU_UnitSize4KB;
    config->pageOpt        = kMMU_PageOpt_1Page;
    config->invalidAddrMode = kMMU_InvalidAddrRespondError;

    config->baseAddr = 0x0UL;
    config->maxAddr  = 0x0UL;

    config->ptrPhyAddrArray = NULL;
    config->ptrVirtualAddrArray = NULL;
    config->countOfAddr = 0U;

    config->enableMMP = false;
}

/*!
 * brief Assert software reset to reset the MMU logic.
 *
 * param base MMU peripheral base address.
 */
void MMU_DoSoftwareReset(MMU_Type *base)
{
    /* Reset MMU logic. */
    base->CTRL |= MMU_CTRL_SWRST_MASK;

    /* Delay six NOP cycles for reset propagation. */
    for (uint8_t i = 0U; i < 6U; i++)
    {
        __NOP();
    }

    /* Disable software reset. */
    base->CTRL &= ~MMU_CTRL_SWRST_MASK;
}

/*!
 * brief Use the blocking method to update LUT SRAM with user-defined words.
 *
 * note This function only return when all words that #ptrLutWord refers are set into LUT SRAM.
 *
 * note This function supports both single write and burst write described in RM, please note that burst write is only
 * useful when to fill continuous value into continuous addresses.
 *
 * note #startPointer + #countOfWords should not exceed the maximum size of LUT SRAM(8192).
 * code
 * Fill continuous values into continuous addresses (E.g: initialize LUT SRAM address 2 and 3 with value 0x12 and 0x13)
 *              mmu_lut_word_t    startLutWord = {
 *                  .targetAddr = 0x12U;
 *                  .valid = 1U;
 *  	        };
 *              MMU_UpdateLUTBlocking(MMU0, 2U, &startLutWord, 2U, kMMU_LUTBurstWrite);
 * endcode
 * code
 * Fill discontinuous values into continuous addresses(E.g: initialize LUT SRAM address 2 and 3 with value 0x12 and
 * 0x34) mmu_lut_word_t lutWordArray[2] = {
 *                  {
 *                      .targetAddr = 0x12U;
 *                      .valid      = 1U;
 *                  },
 *                  {
 *                      .targetAddr = 0x34U;
 *                      .valid      = 1U;
 *                  },
 *              };
 *              MMU_UpdateLUTBlocking(MMU0, 2U, lutWordArray, 2U,kMMU_LUTSingleWrite);
 * endcode
 * code
 * Fill discontinuous values into discontinuous addresses(E.g: initialize LUT SRAM address 2 and 5 with value 0x12 and
 * 0x34)): mmu_lut_word_t addr2LutWord = { .targetAddr = 0x12U; .valid      = 1U;
 *              };
 *              MMU_UpdateLUTBlocking(MMU0, 2U, &addr2LutWord, 1U, kMMU_LUTSingleWrite);
 *
 *              mmu_lut_word_t addr5LutWord = {
 *                  .targetAddr = 0x34U;
 *                  .valid      = 1U;
 *              };
 *              MMU_UpdateLUTBlocking(MMU0, 5U, &addr5LutWord, 1U, kMMU_LUTSingleWrite);
 * endcode
 *
 * param base MMU peripheral base address.
 * param startPointer Start pointer of LUT SRAM to fill new mapping words, range from 0 to 8191.
 * param ptrLutWord Pointer to new lut words:
 *                   if \b writeOperation is selected as \b kMMU_LUTBurstWrite this parameter should be a pointer to the
 *      	            variable which represents the first LUT word to set;
 *                   if \b writeOperation is selected as \b kMMU_LUTSingleWrite this parameter can be set as a pointer
 * to the array that contains all new LUT words to set or set as a pointer to one variable when only want to update one
 * word into LUT's specific pointer. param countOfWord Count to new word to update into LUT SRAM, range from 1 to 8192.
 * param writeOperation Specify the write operation, the meaning of #ptrLutWord is different for
 *                      different write operations.
 */
void MMU_UpdateLUTBlocking(MMU_Type *base,
                           uint16_t startPointer,
                           mmu_lut_word_t *ptrLutWord,
                           uint16_t countOfWord,
                           mmu_lut_write_operation_t writeOperation)
{
    assert(ptrLutWord != NULL);
    assert(countOfWord > 0U);
    /* The LUT SRAM size is 8K word. */
    assert((startPointer + countOfWord) <= 8192U);

    mmu_lut_word_t *tmpPtrLutWord = ptrLutWord;
    uint16_t tmpCount             = countOfWord;

    MMU_UnlockLUT(base);
    if (writeOperation == kMMU_LUTSingleWrite)
    {
        /* In case of single write. */
        base->WRITE_PTR = MMU_WRITE_PTR_POINTER(startPointer);

        do
        {
            base->LUT_WDATA = MMU_LUT_WDATA_ADDR(tmpPtrLutWord->mappedValue) |
                              MMU_LUT_WDATA_VALID(tmpPtrLutWord->valid) | MMU_LUT_WDATA_COUNT(0U);

            tmpPtrLutWord++; /* Increase the pointer to point to next word in array. */
            tmpCount--;
        } while (tmpCount > 0U);
    }
    else
    {
        /* In case of burst write. */
        base->WRITE_PTR = MMU_WRITE_PTR_POINTER(startPointer);
        base->LUT_WDATA = MMU_LUT_WDATA_ADDR(tmpPtrLutWord->mappedValue) | MMU_LUT_WDATA_VALID(tmpPtrLutWord->valid) |
                          MMU_LUT_WDATA_COUNT(tmpCount - 1U);

