solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_mmu.c
        /* Wait for the burst-write operation to complete. */
        while ((base->STS & MMU_STS_BUSY_MASK) != 0UL)
        {
        }
    }
    MMU_LockLUT(base);
}

/*!
 * brief Read the specified number of LUT content from the specified pointer into the user-defined buffer.
 *
 * note #startPointer + #count should not exceed maximum size of LUT SRAM(8192).
 *
 * param base MMU peripheral base address.
 * param startPointer Specify start address to read in LUT SRAM, range from 0 to 8191.
 * param ptrWordReadBuffer Pointer of a buffer that record read out words.
 * param count Specify number of continuous address in LUT SRAM to read, range from 1 to 8192.
 */
void MMU_ReadLUT(MMU_Type *base, uint16_t startPointer, mmu_lut_word_t *ptrWordReadBuffer, uint16_t count)
{
    assert(ptrWordReadBuffer != NULL);
    assert(count > 0U);
    assert((startPointer + count) <= 8192U);

    mmu_lut_word_t *tmpPtrBuffer = ptrWordReadBuffer;
    uint16_t tmpCount            = count;
    uint32_t readData            = 0UL;

    base->READ_PTR = MMU_READ_PTR_POINTER(startPointer);
    do
    {
        readData                  = (((base->LUT_RDATA) & MMU_LUT_RDATA_DATA_MASK) >> MMU_LUT_RDATA_DATA_SHIFT);
        tmpPtrBuffer->mappedValue = (uint16_t)readData & 0x7FFFU;
        tmpPtrBuffer->valid       = ((readData & 0x8000U) != 0U) ? 1U : 0U;
        tmpPtrBuffer++;
        tmpCount--;
    } while (tmpCount > 0U);
}

/*!
 * brief Trigger the specified number of read operations from LUT SRAM, compare with the input golden word, the read
 * address and golden data are increased automatically each time.
 *
 * note This function only return when all read-verify operations are complete.
 *
 * param base MMU peripheral base address.
 * param startPointer The pointer of LUT SRAM which start to check, range from 0 to 8191.
 * param goldenWordToCheck The first golden word to check, in following read-verify operation,
 *                          the golden data will increase automatically.
 *
 * param count Specify number of continuous address in LUT SRAM to check, range from 1 to 8192.
 */
void MMU_TriggerLUTVerificationBlocking(MMU_Type *base,
                                        uint16_t startPointer,
                                        mmu_lut_word_t goldenWordToCheck,
                                        uint16_t count)
{
    assert(count > 0U);
    assert((startPointer + count) <= 8192U);

    base->READ_PTR = MMU_READ_PTR_POINTER(startPointer);
    base->READ_VFY = MMU_READ_VFY_DATA((goldenWordToCheck.mappedValue) | (goldenWordToCheck.valid << 15U)) |
                     MMU_READ_VFY_COUNT(count - 1U);

    /* Wait for the read-verify to complete. */
    while ((base->STS & MMU_STS_BUSY_MASK) != 0UL)
    {
    }
}

/*!
 * brief Get a record of AHB information when an error happens.
 *
 * param base MMU peripheral base address.
 * ptrRecord Pointer to user-defined variable which used to store current AHB error information.
 */
void MMU_GetAHBErrorRecord(MMU_Type *base, mmu_ahb_error_record_t *ptrRecord)
{
    assert(ptrRecord != NULL);
    uint32_t tmpInfo = 0UL;

    tmpInfo = base->FAIL_INFO;

    memcpy(ptrRecord, &tmpInfo, sizeof(uint32_t));
    ptrRecord->failAddr = base->FAIL_ADDR;
}


/*!
 * brief Map one physical unit to the virtual unit.
 * 
 * param base MMU peripheral base address.
 * param virt The unit-aligned virtual address.
 * param phys The unit-aligned virtual address.
 */
void MMU_SetupSimpleMap(MMU_Type *base, uint32_t virt, uint32_t phys)
{
    assert((virt % MMU_UNIT_BYTE_SIZE) == 0UL);
    assert((phys % MMU_UNIT_BYTE_SIZE) == 0UL);

    mmu_lut_word_t lutWord = MMU_TransferAddrToLUTWord(phys);
    uint16_t lutIndex = MMU_TransferAddrToLUTIndex(virt);

    MMU_UpdateLUTBlocking(base, lutIndex, &lutWord, 1U, kMMU_LUTSingleWrite);
}

/*!
 * brief Remove mapping for one unit of provided virtual address.
 * 
 * param base MMU peripheral base address.
 * param virt The unit-aligned virtual address.
 */
void MMU_TearDownSimpleMap(MMU_Type *base, uint32_t virt)
{
    assert((virt % MMU_UNIT_BYTE_SIZE) == 0UL);

    uint16_t lutIndex = MMU_TransferAddrToLUTIndex(virt);
    mmu_lut_word_t lutWord;

    MMU_ReadLUT(base, lutIndex, &lutWord, 1U);
    lutWord.valid = 0U;

    MMU_UpdateLUTBlocking(base, lutIndex, &lutWord, 1U, kMMU_LUTSingleWrite);
}

/*!
 * brief Map a region of physical memory into the virtual address space.
 * 
 * param base MMU peripheral base address.
 * param virt The unit-aligned destination virtual address to map.
 * param phys The unit-aligned source physical address to map.
 * param regionSize Unit-aligned size of mapped memory region in bytes.
 */
void MMU_SetupRegionMap(MMU_Type *base, uint32_t virt, uint32_t phys, size_t regionSize)
{
    assert((virt % MMU_UNIT_BYTE_SIZE) == 0UL);
    assert((phys % MMU_UNIT_BYTE_SIZE) == 0UL);
    assert((regionSize % MMU_UNIT_BYTE_SIZE) == 0UL);

    mmu_lut_word_t lutWord = MMU_TransferAddrToLUTWord(phys);
    uint16_t lutIndex = MMU_TransferAddrToLUTIndex(virt);
    uint16_t unitCount = (regionSize / MMU_UNIT_BYTE_SIZE);

    MMU_UpdateLUTBlocking(base, lutIndex, &lutWord, unitCount, kMMU_LUTBurstWrite);
}

/*!
 * brief Remove mapping for a provided virtual address region.
 * 
 * param base MMU peripheral base address.
 * param virt The unit-aligned virtual address.
 * param regionSize The unit-aligned size of region in bytes.
 */
void MMU_TearDownRegionMap(MMU_Type *base, uint32_t virt, size_t regionSize)
{
    assert((virt % MMU_UNIT_BYTE_SIZE) == 0UL);
    assert((regionSize % MMU_UNIT_BYTE_SIZE) == 0UL);

    mmu_lut_word_t lutWord;
    uint16_t lutIndex = MMU_TransferAddrToLUTIndex(virt);
    uint16_t unitCount = (regionSize / MMU_UNIT_BYTE_SIZE);

    MMU_ReadLUT(base, lutIndex, &lutWord, 1U);
    lutWord.valid = 0U;

    MMU_UpdateLUTBlocking(base, lutIndex, &lutWord, unitCount, kMMU_LUTBurstWrite);
}

/*!
 * brief Remap old virtual region into new address.
 * 
 * param base MMU peripheral base address.
 * param oldVirt The unit-aligned old virtual address.
 * param newVirt The unit-aligned new virtual address.
 * param regionSize The unit-aligned size of region in bytes.
 */
void MMU_RemapRegion(MMU_Type *base, uint32_t oldVirt, uint32_t newVirt, size_t regionSize)
{
    assert((oldVirt % MMU_UNIT_BYTE_SIZE) == 0UL);
    assert((newVirt % MMU_UNIT_BYTE_SIZE) == 0UL);
    assert((regionSize % MMU_UNIT_BYTE_SIZE) == 0UL);

    mmu_lut_word_t lutWord;
    uint16_t oldLutIndex = MMU_TransferAddrToLUTIndex(oldVirt);
    uint16_t newLutIndex = MMU_TransferAddrToLUTIndex(newVirt);
    uint16_t unitCount = (regionSize / MMU_UNIT_BYTE_SIZE);

    /* Setup mapping of new virtual address. */
    MMU_ReadLUT(base, oldLutIndex, &lutWord, 1U);
    lutWord.valid = 1U;
    MMU_UpdateLUTBlocking(base, newLutIndex, &lutWord, unitCount, kMMU_LUTBurstWrite);

    /* Teardown mapping of old virtual address. */
    MMU_TearDownRegionMap(base, oldVirt, regionSize);
}

/*!
 * brief Physically move region of memory, with copy
 *
 * details Maps a region of physical memory into the new virtual address space, and copy region of size from the 
 * old virtual address space. The new virtual memory region is mapped from physical memory starting @p newPhys of
 * size @p regionSize.
 * 
 * param base MMU peripheral base address.
 * param oldVirt Unit-aligned old virtual region address.
 * param newVirt Unit-aligned new virtual region address.
 * param newPhys Unit-aligned new physical region address which will map to new virtual region address.
 * param regionSize Unit-aligned size of region in bytes.
 */
void MMU_MoveRegion(MMU_Type *base, uint32_t oldVirt, uint32_t newVirt, uint32_t newPhys, size_t regionSize)
{
    MMU_SetupRegionMap(base, newVirt, newPhys, regionSize);
    memcpy((void *)newVirt, (void *)oldVirt, regionSize);
    MMU_TearDownRegionMap(base, oldVirt, regionSize);
}

/*!
 * brief Map an array of physical memory address into an array of virtual memory address.
 * 
 * param base MMU peripheral base address.
 * param ptrVirts Pointer to the array which contain unit-aligned virtual address.
 * param ptrPhys Pointer to the array which contain unit-aligned physical address.
 * param count Count of array elements.
 */
void MMU_SetupArrayMap(MMU_Type *base, uint32_t *ptrVirts, uint32_t *ptrPhys, uint32_t count)
{
    for (uint32_t i = 0UL; i < count; i++)
    {
        MMU_SetupSimpleMap(base, ptrVirts[i], ptrPhys[i]);
    }
}

/*!
 * brief Remove mapping of an array of virtual address.
 * 
 * param base MMU peripheral base address.
 * param ptrVirts Pointer to the array which contains unit-aligned virtual address.
 * param count Count of array elements.
 */
void MMU_TearDownArrayMap(MMU_Type *base, uint32_t *ptrVirts, uint32_t count)
{
    for (uint32_t i = 0UL; i < count; i++)
    {
        MMU_TearDownSimpleMap(base, ptrVirts[i]);
    }
}

/*!
 * brief Physical move array of memory, with copy.
 * 
 * details Maps an array of physical memory into the new array of virtual address space( @p ptrNewVirts ), and
 * copy an unit size of data from old array of virtual address to new array of virtual address.
 * 
 * param base MMU peripheral base address.
 * param ptrOldVirts Pointer to the array which contain old unit-aligned virtual address.
 * param ptrNewVirts Pointer to the array which contain new unit-aligned virtual address.
 * param ptrNewPhys Pointer to the array which contain new unit-aligned physical address.
 * param count Count of array elements.
 */
void MMU_MoveArray(MMU_Type *base, uint32_t *ptrOldVirts, uint32_t *ptrNewVirts, uint32_t *ptrNewPhys, uint32_t count)
{
    MMU_SetupArrayMap(base, ptrNewVirts, ptrNewPhys, count);
    for (uint32_t i = 0UL; i < count; i++)
    {
        memcpy((void *)&(ptrNewVirts[i]), (void *)&(ptrOldVirts[i]), MMU_UNIT_BYTE_SIZE);
    }
    MMU_TearDownArrayMap(base, ptrOldVirts, count);
}

/*!
 * brief Get mapped physical address from input virtual address.
 * 
 * param base MMU peripheral base address.
 * param virt The virtual address.
 * param[out] ptrPtrs Pointer to the variable to store mapped physical address.
 */
void MMU_GetPhyAddr(MMU_Type *base, uint32_t virt, uint32_t *ptrPtrs)
{
    uint32_t shiftArray[MMU_NUM_OF_UNIT_SIZE] =
    {
        12UL, /* Shift for 4KB unit size */
        13UL, /* Shift for 8KB unit size */
        14UL, /* Shift for 16KB unit size */
        15UL, /* Shift for 32KB unit size */
        16UL, /* Shift for 64KB unit size */
    };

    uint32_t maskArray[MMU_NUM_OF_UNIT_SIZE] =
    {
        0xFFFUL,    /* Mask for 4KB unit size. */
        0x1FFFUL,   /* Mask for 8KB unit size. */
        0x3FFFUL,   /* Mask for 16KB unit size. */
        0x7FFFUL,   /* Mask for 32KB unit size. */
        0xFFFFUL,   /* Mask for 64KB unit size. */
    };
    uint16_t lutIndex = MMU_TransferAddrToLUTIndex(virt);
    mmu_lut_word_t lutWord;
    uint32_t mapAddr = 0UL;

    MMU_ReadLUT(base, lutIndex, &lutWord, 1U);
    mapAddr = (uint32_t)lutWord.mappedValue << shiftArray[(uint8_t)g_selectedUnitSize];

    (*ptrPtrs) = ((virt & 0xF0000000UL) | mapAddr | (virt & maskArray[(uint8_t)g_selectedUnitSize]));
}
